jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32TGxxx_DFP.1.1.0.pdsc
        <!-- *************************  Device 'EFM32TG232F8'  ***************************** -->
        <device Dname="EFM32TG232F8">
          <compile header="Device\EFM32TG\Include\em_device.h" define="EFM32TG232F8"/>
          <debug svd="SVD\EFM32TG\EFM32TG232F8.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00002000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32TG230'  **************************** -->
      <subFamily DsubFamily="EFM32TG230">
        <feature type="AnalogOther"   n="3"                           name="Operational Amplifier"/>
        <feature type="IOs"           n="56"                          name="General Purpose I/O pins"/>
        <feature type="Crypto"        n="1"                           name="Hardware AES with 128/256-bit keys in 54/75 cycles"/>
        <feature type="ADC"           n="1"       m="12"              name="12-bit 1 Msamples/s Analog to Digital Converter"/>

        <book name="Documents\EFM32TG230.pdf" title="EFM32TG230 Data Sheet"/>

        <!-- *************************  Device 'EFM32TG230F32'  ***************************** -->
        <device Dname="EFM32TG230F32">
          <compile header="Device\EFM32TG\Include\em_device.h" define="EFM32TG230F32"/>
          <debug svd="SVD\EFM32TG\EFM32TG230F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG230F16'  ***************************** -->
        <device Dname="EFM32TG230F16">
          <compile header="Device\EFM32TG\Include\em_device.h" define="EFM32TG230F16"/>
          <debug svd="SVD\EFM32TG\EFM32TG230F16.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00004000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG230F8'  ***************************** -->
        <device Dname="EFM32TG230F8">
          <compile header="Device\EFM32TG\Include\em_device.h" define="EFM32TG230F8"/>
          <debug svd="SVD\EFM32TG\EFM32TG230F8.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00002000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32TG225'  **************************** -->
      <subFamily DsubFamily="EFM32TG225">
        <feature type="AnalogOther"   n="3"                           name="Operational Amplifier"/>
        <feature type="IOs"           n="37"                          name="General Purpose I/O pins"/>
        <feature type="Crypto"        n="1"                           name="Hardware AES with 128/256-bit keys in 54/75 cycles"/>
        <feature type="ADC"           n="1"       m="12"              name="12-bit 1 Msamples/s Analog to Digital Converter"/>

        <book name="Documents\EFM32TG225.pdf" title="EFM32TG225 Data Sheet"/>

        <!-- *************************  Device 'EFM32TG225F32'  ***************************** -->
        <device Dname="EFM32TG225F32">
          <compile header="Device\EFM32TG\Include\em_device.h" define="EFM32TG225F32"/>
          <debug svd="SVD\EFM32TG\EFM32TG225F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG225F16'  ***************************** -->
        <device Dname="EFM32TG225F16">
          <compile header="Device\EFM32TG\Include\em_device.h" define="EFM32TG225F16"/>
          <debug svd="SVD\EFM32TG\EFM32TG225F16.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00004000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32TG225F8'  ***************************** -->
        <device Dname="EFM32TG225F8">
          <compile header="Device\EFM32TG\Include\em_device.h" define="EFM32TG225F8"/>
          <debug svd="SVD\EFM32TG\EFM32TG225F8.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00002000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32TG222'  **************************** -->
      <subFamily DsubFamily="EFM32TG222">
        <feature type="AnalogOther"   n="3"                           name="Operational Amplifier"/>
        <feature type="IOs"           n="37"                          name="General Purpose I/O pins"/>
        <feature type="Crypto"        n="1"                           name="Hardware AES with 128/256-bit keys in 54/75 cycles"/>
        <feature type="ADC"           n="1"       m="12"              name="12-bit 1 Msamples/s Analog to Digital Converter"/>

